3B/SE464/src/11-Software-Architecture-Modeling.org
#+title: Software Architecture Modeling
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Architectural Modeling
*Architectural Model*: artifact that captures some or all design decisions that
comprise a system's architecture

*Architectural Modeling*: reification and documentation of design decisions

*Architectural Modeling Notation*: language or means of capturing design decisions

Architects and other stakeholders must make critical modeling decisions (what, how
detailed, formality), weighing cost and benefit.

Model basic architectural elements like components, connectors, interfaces,
configurations, and rationale (reasoning behind decisions).
Also model constraints on interactions, behaviour, and concurrency.

Aspects:
- *static*: do not change as system runs
- *dynamic*: change as system runs
- *functional*: something the system does directly
- *non-functional*: something about the qualities of the system

* Software Performance Models
Includes _Execution Graphs_, _Queueing Networks_, and
_Machine learning-based performance needs_.

*Formal representations*: capture aspects of software performance,
help understand non-functional requirements

Software Performance Models allow:
- estimating _performance_ of software
- estimating _resource needs_
- identify _performance issues_ as early as possible
- _simulate_ execution of software under certain conditions (number of users
  and size of infrastructure)
- establish performance for average, best, and worst-case scenarios

Design models of system capture static aspects, performance models capture
dynamic aspects.

* Software Execution Models
Constructed early in development process to ensure that chosen software
architecture can achieve required performance objectives.

Provides static analysis of mean, best, and worst case response times.

Generally sufficient for identifying serious performance problems at
architectural and early design phases.

Absence of problems in software model does not mean there are none.

** Execution Graphs
Execution graphs represent sequence of operations of system, and are constructed
for each performance scenario.

Not sufficient for a complete analysis of software performance but work well
for understanding software and non-functional requirements.
Special annotation can give idea of performance.
Combine graphs with other models to complement analysis.

*** Graph Notation
_Basic nodes_: represent processing steps at lowest level of detail
that is appropriate for current development stage

_Expanded nodes_: represent processing steps elaborated in another subgraph

_Repetition nodes_: subsequent nodes repeated $n$ times, last node has an edge
to the repeat node

_Case node_: represent conditional execution of processing steps, each
attached node has a probability of execution

_Pardo node_: attached nodes run in parallel: all nodes must complete (join)
before proceeding

_Division node_: attached nodes represent new processing threads, need not all
complete before proceeding

