3B/SE464/11-Software-Architecture-Modeling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-08 Sun 00:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Architecture Modeling</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Software Architecture Modeling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2a6d760">1. Architectural Modeling</a></li>
<li><a href="#org79e8c67">2. Software Performance Models</a></li>
<li><a href="#orgeb1fe1c">3. Software Execution Models</a>
<ul>
<li><a href="#orgede8ba6">3.1. Execution Graphs</a>
<ul>
<li><a href="#orgd8dbf4a">3.1.1. Graph Notation</a></li>
</ul>
</li>
<li><a href="#org799b214">3.2. Execution Model Analysis</a></li>
<li><a href="#orgb7c2d0d">3.3. Software Resource Requirements</a></li>
</ul>
</li>
<li><a href="#org58be6d1">4. Queuing Network Models</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2a6d760" class="outline-2">
<h2 id="org2a6d760"><span class="section-number-2">1.</span> Architectural Modeling</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Architectural Model</b>: artifact that captures some or all design decisions that
comprise a system&rsquo;s architecture
</p>

<p>
<b>Architectural Modeling</b>: reification and documentation of design decisions
</p>

<p>
<b>Architectural Modeling Notation</b>: language or means of capturing design decisions
</p>

<p>
Architects and other stakeholders must make critical modeling decisions (what, how
detailed, formality), weighing cost and benefit.
</p>

<p>
Model basic architectural elements like components, connectors, interfaces,
configurations, and rationale (reasoning behind decisions).
Also model constraints on interactions, behaviour, and concurrency.
</p>

<p>
Aspects:
</p>
<ul class="org-ul">
<li><b>static</b>: do not change as system runs</li>
<li><b>dynamic</b>: change as system runs</li>
<li><b>functional</b>: something the system does directly</li>
<li><b>non-functional</b>: something about the qualities of the system</li>
</ul>
</div>
</div>
<div id="outline-container-org79e8c67" class="outline-2">
<h2 id="org79e8c67"><span class="section-number-2">2.</span> Software Performance Models</h2>
<div class="outline-text-2" id="text-2">
<p>
Includes <span class="underline">Execution Graphs</span>, <span class="underline">Queueing Networks</span>, and
<span class="underline">Machine learning-based performance needs</span>.
</p>

<p>
<b>Formal representations</b>: capture aspects of software performance,
help understand non-functional requirements
</p>

<p>
Software Performance Models allow:
</p>
<ul class="org-ul">
<li>estimating <span class="underline">performance</span> of software</li>
<li>estimating <span class="underline">resource needs</span></li>
<li>identify <span class="underline">performance issues</span> as early as possible</li>
<li><span class="underline">simulate</span> execution of software under certain conditions (number of users
and size of infrastructure)</li>
<li>establish performance for average, best, and worst-case scenarios</li>
</ul>

<p>
Design models of system capture static aspects, performance models capture
dynamic aspects.
</p>
</div>
</div>
<div id="outline-container-orgeb1fe1c" class="outline-2">
<h2 id="orgeb1fe1c"><span class="section-number-2">3.</span> Software Execution Models</h2>
<div class="outline-text-2" id="text-3">
<p>
Constructed early in development process to ensure that chosen software
architecture can achieve required performance objectives.
</p>

<p>
Provides static analysis of mean, best, and worst case response times.
</p>

<p>
Generally sufficient for identifying serious performance problems at
architectural and early design phases.
</p>

<p>
Absence of problems in software model does not mean there are none.
</p>
</div>
<div id="outline-container-orgede8ba6" class="outline-3">
<h3 id="orgede8ba6"><span class="section-number-3">3.1.</span> Execution Graphs</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Execution graphs represent sequence of operations of system, and are constructed
for each performance scenario.
</p>

<p>
Not sufficient for a complete analysis of software performance but work well
for understanding software and non-functional requirements.
Special annotation can give idea of performance.
Combine graphs with other models to complement analysis.
</p>
</div>
<div id="outline-container-orgd8dbf4a" class="outline-4">
<h4 id="orgd8dbf4a"><span class="section-number-4">3.1.1.</span> Graph Notation</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<span class="underline">Basic nodes</span>: represent processing steps at lowest level of detail
that is appropriate for current development stage
</p>

<p>
<span class="underline">Expanded nodes</span>: represent processing steps elaborated in another subgraph
</p>

<p>
<span class="underline">Repetition nodes</span>: subsequent nodes repeated \(n\) times, last node has an edge
to the repeat node
</p>

<p>
<span class="underline">Case node</span>: represent conditional execution of processing steps, each
attached node has a probability of execution
</p>

<p>
<span class="underline">Pardo node</span>: attached nodes run in parallel: all nodes must complete (join)
before proceeding
</p>

<p>
<span class="underline">Division node</span>: attached nodes represent new processing threads, need not all
complete before proceeding
</p>
</div>
</div>
</div>
