3B/SE464/11-Software-Architecture-Modeling.tex
% Created 2024-12-08 Sun 00:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Software Architecture Modeling}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Software Architecture Modeling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Architectural Modeling}
\label{sec:orgd8495da}
\textbf{Architectural Model}: artifact that captures some or all design decisions that
comprise a system's architecture

\textbf{Architectural Modeling}: reification and documentation of design decisions

\textbf{Architectural Modeling Notation}: language or means of capturing design decisions

Architects and other stakeholders must make critical modeling decisions (what, how
detailed, formality), weighing cost and benefit.

Model basic architectural elements like components, connectors, interfaces,
configurations, and rationale (reasoning behind decisions).
Also model constraints on interactions, behaviour, and concurrency.

Aspects:
\begin{itemize}
\item \textbf{static}: do not change as system runs
\item \textbf{dynamic}: change as system runs
\item \textbf{functional}: something the system does directly
\item \textbf{non-functional}: something about the qualities of the system
\end{itemize}
\section{Software Performance Models}
\label{sec:org2919fd1}
Includes \uline{Execution Graphs}, \uline{Queueing Networks}, and
\uline{Machine learning-based performance needs}.

\textbf{Formal representations}: capture aspects of software performance,
help understand non-functional requirements

Software Performance Models allow:
\begin{itemize}
\item estimating \uline{performance} of software
\item estimating \uline{resource needs}
\item identify \uline{performance issues} as early as possible
\item \uline{simulate} execution of software under certain conditions (number of users
and size of infrastructure)
\item establish performance for average, best, and worst-case scenarios
\end{itemize}

Design models of system capture static aspects, performance models capture
dynamic aspects.
\section{Software Execution Models}
\label{sec:org3ce5478}
Constructed early in development process to ensure that chosen software
architecture can achieve required performance objectives.

Provides static analysis of mean, best, and worst case response times.

Generally sufficient for identifying serious performance problems at
architectural and early design phases.

Absence of problems in software model does not mean there are none.
\subsection{Execution Graphs}
\label{sec:orgc6c15d1}
Execution graphs represent sequence of operations of system, and are constructed
for each performance scenario.

Not sufficient for a complete analysis of software performance but work well
for understanding software and non-functional requirements.
Special annotation can give idea of performance.
Combine graphs with other models to complement analysis.
\subsubsection{Graph Notation}
\label{sec:orgfb1c861}
\uline{Basic nodes}: represent processing steps at lowest level of detail
that is appropriate for current development stage

\uline{Expanded nodes}: represent processing steps elaborated in another subgraph

\uline{Repetition nodes}: subsequent nodes repeated \(n\) times, last node has an edge
to the repeat node

\uline{Case node}: represent conditional execution of processing steps, each
attached node has a probability of execution

\uline{Pardo node}: attached nodes run in parallel: all nodes must complete (join)
before proceeding

\uline{Division node}: attached nodes represent new processing threads, need not all
complete before proceeding
