3B/SE464/src/11-Software-Architecture-Modeling.org
** Execution Model Analysis
Software execution model analysis helps:
- make quick check of best-case response time to ensure architecture
  and design will lead to satisfactory performance
- assess performance impact of alternatives
- identify critical parts of system for performance management
- derive params for system execution model

Algorithms are formulated for evaluating graphs.

Basic solution algorithms are easy to understand by examining graphs,
identifying basic structure, computing time of basic structure and
reducing basic structure to a computed node, and continuing until only
one node left.

Basic structures are sequences, loops, and cases.

Computation for case nodes differs for:
- _shortest path_: time for case node is minimum of times for
  conditionally executed nodes
- _longest path_: time for case node is maximum of times for
  conditionally executed nodes
- _average analysis_: time is multiplying each node's time by
  execution probability

** Software Resource Requirements
Each basic node has specified software resource requirements $A_{j}$
for each service unit $j$.

*Processing Overhead Matrix*: chart of computer (hardware) resource requirements for each
of the software resource requirements

To compute total execution time:
1. use processing overhead matrix to calculate total computer resources required per
   software resource for each node in the graph
2. compute total computer resource requirements for the graph
3. compute best-case elapsed time

