3B/SE464/11-Software-Architecture-Modeling.html
<div id="outline-container-org799b214" class="outline-3">
<h3 id="org799b214"><span class="section-number-3">3.2.</span> Execution Model Analysis</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Software execution model analysis helps:
</p>
<ul class="org-ul">
<li>make quick check of best-case response time to ensure architecture
and design will lead to satisfactory performance</li>
<li>assess performance impact of alternatives</li>
<li>identify critical parts of system for performance management</li>
<li>derive params for system execution model</li>
</ul>

<p>
Algorithms are formulated for evaluating graphs.
</p>

<p>
Basic solution algorithms are easy to understand by examining graphs,
identifying basic structure, computing time of basic structure and
reducing basic structure to a computed node, and continuing until only
one node left.
</p>

<p>
Basic structures are sequences, loops, and cases.
</p>

<p>
Computation for case nodes differs for:
</p>
<ul class="org-ul">
<li><span class="underline">shortest path</span>: time for case node is minimum of times for
conditionally executed nodes</li>
<li><span class="underline">longest path</span>: time for case node is maximum of times for
conditionally executed nodes</li>
<li><span class="underline">average analysis</span>: time is multiplying each node&rsquo;s time by
execution probability</li>
</ul>
</div>
</div>
<div id="outline-container-orgb7c2d0d" class="outline-3">
<h3 id="orgb7c2d0d"><span class="section-number-3">3.3.</span> Software Resource Requirements</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Each basic node has specified software resource requirements \(A_{j}\)
for each service unit \(j\).
</p>

<p>
<b>Processing Overhead Matrix</b>: chart of computer (hardware) resource requirements for each
of the software resource requirements
</p>

<p>
To compute total execution time:
</p>
<ol class="org-ol">
<li>use processing overhead matrix to calculate total computer resources required per
software resource for each node in the graph</li>
<li>compute total computer resource requirements for the graph</li>
<li>compute best-case elapsed time</li>
</ol>
</div>
</div>
</div>
