3B/SE464/11-Software-Architecture-Modeling.tex
\subsection{Execution Model Analysis}
\label{sec:orgd8f9ef1}
Software execution model analysis helps:
\begin{itemize}
\item make quick check of best-case response time to ensure architecture
and design will lead to satisfactory performance
\item assess performance impact of alternatives
\item identify critical parts of system for performance management
\item derive params for system execution model
\end{itemize}

Algorithms are formulated for evaluating graphs.

Basic solution algorithms are easy to understand by examining graphs,
identifying basic structure, computing time of basic structure and
reducing basic structure to a computed node, and continuing until only
one node left.

Basic structures are sequences, loops, and cases.

Computation for case nodes differs for:
\begin{itemize}
\item \uline{shortest path}: time for case node is minimum of times for
conditionally executed nodes
\item \uline{longest path}: time for case node is maximum of times for
conditionally executed nodes
\item \uline{average analysis}: time is multiplying each node's time by
execution probability
\end{itemize}
\subsection{Software Resource Requirements}
\label{sec:org5fb967a}
Each basic node has specified software resource requirements \(A_{j}\)
for each service unit \(j\).

\textbf{Processing Overhead Matrix}: chart of computer (hardware) resource requirements for each
of the software resource requirements

To compute total execution time:
\begin{enumerate}
\item use processing overhead matrix to calculate total computer resources required per
software resource for each node in the graph
\item compute total computer resource requirements for the graph
\item compute best-case elapsed time
\end{enumerate}
