3B/SE464/11-Software-Architecture-Modeling.html
<div id="outline-container-org58be6d1" class="outline-2">
<h2 id="org58be6d1"><span class="section-number-2">4.</span> Queuing Network Models</h2>
<div class="outline-text-2" id="text-4">
<p>
Software execution models provide a static analysis of the mean, best, and worst case
response times for software and characterize resource requirements of proposed software alone.
</p>

<p>
<b>Queuing Network Models</b> characterize software&rsquo;s performance in the presence of
dynamic factors (like other workloads or multiple users) and aims to solve resource
contention.
</p>

<p>
If software execution model indicates no problems, ready to construct and solve
queuing networks to account for contention efforts.
</p>

<p>
Benefits of QNM:
</p>
<ul class="org-ul">
<li>more precise metrics that account for <span class="underline">resource contention</span></li>
<li>sensitivity of performance metrics to <span class="underline">variations in workload</span> composition</li>
<li><span class="underline">scalability</span> of hardware and software to meet future demands</li>
<li>effect of new software on <span class="underline">service level objectives</span> of other systems</li>
<li>identification of <span class="underline">bottleneck</span> resources</li>
<li>comparative data on <span class="underline">performance improvement options</span></li>
</ul>

<p>
Resource contention can come from:
</p>
<ul class="org-ul">
<li>multiple users of an application or transaction executing at once</li>
<li>multiple applications or systems executing on the same hardware at once</li>
<li>concurrent processes</li>
<li>multi-threaded application</li>
</ul>

<p>
Key computer system resources in QNM are server and queue:
</p>
<ul class="org-ul">
<li><b>server</b>: component of the environment that provides some service
to the software</li>
<li><b>queue</b>: jobs waiting for service, consists of waiting line and server</li>
</ul>

<p>
Kendall notation for queues is A/S/m/B/K/SD:
</p>
<ul class="org-ul">
<li>\(A\) is interarrival time distribution</li>
<li>\(S\) is service time distribution</li>
<li>\(m\) is number of servers</li>
<li>\(B\) is number of buffers (service capacity)</li>
<li>\(K\) is population size</li>
<li>\(SD\) is service discipline</li>
</ul>

<p>
Distributions can be:
</p>
<ul class="org-ul">
<li>M: exponential</li>
<li>E: Erlang with param \(k\)</li>
<li>H: hyperexponential with param \(k\)</li>
<li>D: deterministic</li>
<li>G: general</li>
</ul>

<p>
Performance metrics of interest:
</p>
<ul class="org-ul">
<li><b>residence time (RT)</b>: average time jobs spend in server, in service
and waiting</li>
<li><b>utilization (U)</b>: average percentage of time server is busy</li>
<li><b>throughput (X)</b>: average rate at which jobs complete service</li>
<li><b>queue length (N)</b>: average numbers of jobs at the server (receiving
service and waiting)</li>
</ul>

<p>
Value of metrics depends on:
</p>
<ul class="org-ul">
<li>number of jobs</li>
<li>amount of service they need</li>
<li>time required for server to process individual jobs</li>
<li>policy used to select next job from queue</li>
</ul>

<p>
Can know performance from Kendall notation values.
</p>

<p>
For busy time \(B\), completed jobs \(C\), and total period \(T\) (and the
above performance metrics):
</p>
<ul class="org-ul">
<li>utilization: \(U = B/T\)</li>
<li>throughput: \(X = C/T\)</li>
<li>mean service time: \(S = B/C\)</li>
<li>area under graph: \(W = \sum_{time}(\text{number of jobs})\)</li>
<li>residence time: \(RT = W/C\)</li>
<li>queue length: \(N = W/T\)</li>
</ul>

<p>
In early phases of development, can&rsquo;t make measurement of software
to derive execution profile.
</p>

<p>
<b>Workload intensity</b>: measure of number of requests made by a workload in given
time interval
</p>

<p>
<b>Service requirement</b>: amount of time that workload requires from each device in
processing facility
</p>

<p>
<b>Jobs-flow balance</b>: assume that system is fast enough to handle arrivals and thus
completion rate or throughput equals arrival rate
</p>

<p>
Let \(\lambda\) be arrival rate (workload intensity) and \(S\) be mean service time (service
requirements).
Then:
</p>
<ul class="org-ul">
<li>throughput: \(X = \lambda\)</li>
<li>utilization law: \(U = XS\)</li>
<li>residence time: \(RT = \frac{S}{1 - U}\)</li>
<li>queue length: \(N = X * RT\) (Little&rsquo;s Law)</li>
</ul>

<p>
To find <b>steady-state probabilities</b> of birth-death process, define the rate
at which events occur (birth rate and death rate):
</p>
<ul class="org-ul">
<li>let \(\lambda_{n}\) be the birth rate when the system is in state \(n\)</li>
<li>let \(\mu_{n}\) be the death rate when the system is in state \(n\)</li>
<li>let \(\rho_{n}\) be the steady-state probability of being in state \(n\)</li>
<li>then rate of flow into state \(n\) is rate of flow out of state \(n\) (since
steady-state)
$$&rho;<sub>n</sub> &lambda;<sub>n</sub> = &rho;<sub>n+1</sub> &mu;<sub>n+1</sub>$</li>
</ul>

<p>
For general \(\rho_{n}\):
\[ \rho_{n} = \frac{\prod_{i=0}^{n-1} \lambda_{i}}{\prod_{i=1}^{n}} \rho_{0} \]
</p>

<p>
Probability of having \(n\) jobs in the system for M/M/1 queue:
\[ \rho_{n} = \left( \frac{\lambda}{\mu} \right)^{n} \rho_{0} \]
where \(\frac{\lambda}{\mu}\) is the traffic intensity, average number of customers
arriving compared to the number being served.
</p>

<p>
Probability of having \(n\) or more jobs in the system for M/M/1 queue:
\[ \left( \frac{\lambda}{\mu} \right)^{n} \]
</p>

<p>
Mean number of jobs in the system:
\[ \frac{\frac{\lambda}{\mu}}{1 - \frac{\lambda}{\mu}} \]
</p>

<p>
For M/M/m queue, birth rate is arrival rate which is \(\lambda\) and
death rate is service rate which is
\(\mu_{n} = n \mu\) for \(n = 1, \dots, m-1\) and \(\mu_{n} = m \mu\) for \(n \ge m\):
</p>
<ul class="org-ul">
<li>utility is \(\rho = \lambda / m \mu\)</li>
<li>probability of having \(n\) jobs in the system is
\[ \frac{(m \rho)^{n}}{n!} p_{0} \] for \(n = 1, \dots, m-1\)
and \[ \frac{\rho^{n} m^{m}}{m!} p_{0} \] for \(n \ge m\)</li>
<li>probability that an arrivign job has to wait in the queue is
\[ p_{0} \frac{(m \rho)^{m}}{m!} \sum_{n=m}^{\infty} \rho^{n-m} \]</li>
</ul>

<p>
<b>Queuing network</b> consists of 2+ queues connected together and serve requests
sent by clients.
</p>

<p>
Request routing in queuing network is specified by <b>probability matrix</b>.
</p>

<p>
Types of QNM:
</p>
<ul class="org-ul">
<li><b>open models</b>: requests come from a source external of queuing network and leave
network after service completion
<ul class="org-ul">
<li>appropriate for systems with external arrivals and departures</li>
<li>specify workload intensity and service requirements
<ul class="org-ul">
<li>workload is arrival rate</li>
<li>service requirements are number of visits for each device and average
service time per visit (or total demand for that device)</li>
</ul></li>
</ul></li>
<li><b>closed models</b>: no external source of requests and no departing requests (population
of requests in queuing network remains constant)
<ul class="org-ul">
<li>needs number of users and think time (average delay between receipt of response
and submission of next)</li>
</ul></li>
<li><b>mixed models</b>: open for some workload classes and closed for others</li>
</ul>

<p>
To derive system model params from software model results:
</p>
<ol class="org-ol">
<li>use queue-servers to represent key computer resources or devices specified in
the software execution model and add connections between queues to complete model
topology</li>
<li>decide whether system is best modeled as an open or closed QNM</li>
<li>determine workload intensities for each scenario</li>
<li>specify service requirements</li>
</ol>

<p>
Modeling hints:
</p>
<ul class="org-ul">
<li>multiple users and workload</li>
<li>average vs peak performance (basic QNMs calculate average values)</li>
<li>sensitivity: if small change in one param causes large change in
computed metrics, model is sensitive to that quantity</li>
<li>scalability: improves response times for anticipated future loads</li>
<li>bottlenecks: bottleneck device is one with highest utilization</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-08 Sun 00:10</p>
</div>
</body>
</html>
