3B/SE464/11-Software-Architecture-Modeling.tex
\section{Queuing Network Models}
\label{sec:orgb6a1a22}
Software execution models provide a static analysis of the mean, best, and worst case
response times for software and characterize resource requirements of proposed software alone.

\textbf{Queuing Network Models} characterize software's performance in the presence of
dynamic factors (like other workloads or multiple users) and aims to solve resource
contention.

If software execution model indicates no problems, ready to construct and solve
queuing networks to account for contention efforts.

Benefits of QNM:
\begin{itemize}
\item more precise metrics that account for \uline{resource contention}
\item sensitivity of performance metrics to \uline{variations in workload} composition
\item \uline{scalability} of hardware and software to meet future demands
\item effect of new software on \uline{service level objectives} of other systems
\item identification of \uline{bottleneck} resources
\item comparative data on \uline{performance improvement options}
\end{itemize}

Resource contention can come from:
\begin{itemize}
\item multiple users of an application or transaction executing at once
\item multiple applications or systems executing on the same hardware at once
\item concurrent processes
\item multi-threaded application
\end{itemize}

Key computer system resources in QNM are server and queue:
\begin{itemize}
\item \textbf{server}: component of the environment that provides some service
to the software
\item \textbf{queue}: jobs waiting for service, consists of waiting line and server
\end{itemize}

Kendall notation for queues is A/S/m/B/K/SD:
\begin{itemize}
\item \(A\) is interarrival time distribution
\item \(S\) is service time distribution
\item \(m\) is number of servers
\item \(B\) is number of buffers (service capacity)
\item \(K\) is population size
\item \(SD\) is service discipline
\end{itemize}

Distributions can be:
\begin{itemize}
\item M: exponential
\item E: Erlang with param \(k\)
\item H: hyperexponential with param \(k\)
\item D: deterministic
\item G: general
\end{itemize}

Performance metrics of interest:
\begin{itemize}
\item \textbf{residence time (RT)}: average time jobs spend in server, in service
and waiting
\item \textbf{utilization (U)}: average percentage of time server is busy
\item \textbf{throughput (X)}: average rate at which jobs complete service
\item \textbf{queue length (N)}: average numbers of jobs at the server (receiving
service and waiting)
\end{itemize}

Value of metrics depends on:
\begin{itemize}
\item number of jobs
\item amount of service they need
\item time required for server to process individual jobs
\item policy used to select next job from queue
\end{itemize}

Can know performance from Kendall notation values.

For busy time \(B\), completed jobs \(C\), and total period \(T\) (and the
above performance metrics):
\begin{itemize}
\item utilization: \(U = B/T\)
\item throughput: \(X = C/T\)
\item mean service time: \(S = B/C\)
\item area under graph: \(W = \sum_{time}(\text{number of jobs})\)
\item residence time: \(RT = W/C\)
\item queue length: \(N = W/T\)
\end{itemize}

In early phases of development, can't make measurement of software
to derive execution profile.

\textbf{Workload intensity}: measure of number of requests made by a workload in given
time interval

\textbf{Service requirement}: amount of time that workload requires from each device in
processing facility

\textbf{Jobs-flow balance}: assume that system is fast enough to handle arrivals and thus
completion rate or throughput equals arrival rate

Let \(\lambda\) be arrival rate (workload intensity) and \(S\) be mean service time (service
requirements).
Then:
\begin{itemize}
\item throughput: \(X = \lambda\)
\item utilization law: \(U = XS\)
\item residence time: \(RT = \frac{S}{1 - U}\)
\item queue length: \(N = X * RT\) (Little's Law)
\end{itemize}

To find \textbf{steady-state probabilities} of birth-death process, define the rate
at which events occur (birth rate and death rate):
\begin{itemize}
\item let \(\lambda_{n}\) be the birth rate when the system is in state \(n\)
\item let \(\mu_{n}\) be the death rate when the system is in state \(n\)
\item let \(\rho_{n}\) be the steady-state probability of being in state \(n\)
\item then rate of flow into state \(n\) is rate of flow out of state \(n\) (since
steady-state)
\$\$\(\rho\)\textsubscript{n} \(\lambda\)\textsubscript{n} = \(\rho\)\textsubscript{n+1} \(\mu\)\textsubscript{n+1}\$
\end{itemize}

For general \(\rho_{n}\):
$$ \rho_{n} = \frac{\prod_{i=0}^{n-1} \lambda_{i}}{\prod_{i=1}^{n}} \rho_{0} $$

Probability of having \(n\) jobs in the system for M/M/1 queue:
$$ \rho_{n} = \left( \frac{\lambda}{\mu} \right)^{n} \rho_{0} $$
where \(\frac{\lambda}{\mu}\) is the traffic intensity, average number of customers
arriving compared to the number being served.

Probability of having \(n\) or more jobs in the system for M/M/1 queue:
$$ \left( \frac{\lambda}{\mu} \right)^{n} $$

Mean number of jobs in the system:
$$ \frac{\frac{\lambda}{\mu}}{1 - \frac{\lambda}{\mu}} $$

For M/M/m queue, birth rate is arrival rate which is \(\lambda\) and
death rate is service rate which is
\(\mu_{n} = n \mu\) for \(n = 1, \dots, m-1\) and \(\mu_{n} = m \mu\) for \(n \ge m\):
\begin{itemize}
\item utility is \(\rho = \lambda / m \mu\)
\item probability of having \(n\) jobs in the system is
$$ \frac{(m \rho)^{n}}{n!} p_{0} $$ for \(n = 1, \dots, m-1\)
and $$ \frac{\rho^{n} m^{m}}{m!} p_{0} $$ for \(n \ge m\)
\item probability that an arrivign job has to wait in the queue is
$$ p_{0} \frac{(m \rho)^{m}}{m!} \sum_{n=m}^{\infty} \rho^{n-m} $$
\end{itemize}

\textbf{Queuing network} consists of 2+ queues connected together and serve requests
sent by clients.

Request routing in queuing network is specified by \textbf{probability matrix}.

Types of QNM:
\begin{itemize}
\item \textbf{open models}: requests come from a source external of queuing network and leave
network after service completion
\begin{itemize}
\item appropriate for systems with external arrivals and departures
\item specify workload intensity and service requirements
\begin{itemize}
\item workload is arrival rate
\item service requirements are number of visits for each device and average
service time per visit (or total demand for that device)
\end{itemize}
\end{itemize}
\item \textbf{closed models}: no external source of requests and no departing requests (population
of requests in queuing network remains constant)
\begin{itemize}
\item needs number of users and think time (average delay between receipt of response
and submission of next)
\end{itemize}
\item \textbf{mixed models}: open for some workload classes and closed for others
\end{itemize}

To derive system model params from software model results:
\begin{enumerate}
\item use queue-servers to represent key computer resources or devices specified in
the software execution model and add connections between queues to complete model
topology
\item decide whether system is best modeled as an open or closed QNM
\item determine workload intensities for each scenario
\item specify service requirements
\end{enumerate}

Modeling hints:
\begin{itemize}
\item multiple users and workload
\item average vs peak performance (basic QNMs calculate average values)
\item sensitivity: if small change in one param causes large change in
computed metrics, model is sensitive to that quantity
\item scalability: improves response times for anticipated future loads
\item bottlenecks: bottleneck device is one with highest utilization
\end{itemize}
\end{document}
